[
  "Meta Reports Fourth Quarter and Full Year 2024 Results\nMENLO PARK, Calif. – January 29, 2025 – Meta Platforms, Inc. (Nasdaq: META) today reported financial results for the \nquarter and full year ended December 31, 2024.\n\"We continue to make good progress on AI, glasses, and the future of social media,\" said Mark Zuckerberg, Meta founder \nand CEO. \"I'm excited to see these efforts scale further in 2025.\"\nFourth Quarter and Full Year 2024 Financial Highlights\nThree Months Ended December 31,\n % Change\nTwelve Months Ended December 31,\n% Change\nIn millions, except percentages and \nper share amounts\n2024\n2023\n2024\n2023\nRevenue\n$ \n48,385 \n$ \n40,111 \n 21 % $ \n164,501 \n$ \n134,902 \n 22 %\nCosts and expenses\n \n25,020 \n \n23,727 \n 5 %  \n95,121 \n \n88,151 \n 8 %\nIncome from operations\n$ \n23,365 \n$ \n16,384 \n 43 % $ \n69,380 \n$ \n46,751 \n 48 %\nOperating margin\n 48 %\n 41 %\n 42 %\n 35 %\nProvision for income taxes\n$ \n2,715 \n$ \n2,791 \n (3) % $ \n8,303 \n$ \n8,330 \n — %\nEffective tax rate\n 12 %\n 17 %\n 12 %\n 18 %\nNet income\n$ \n20,838 \n$ \n14,017 \n 49 % $ \n62,360 \n$ \n39,098 \n 59 %\nDiluted earnings per share \n(EPS)\n$ \n8.02 \n$ \n5.33 \n 50 % $ \n23.86 \n$ \n14.87 \n 60 %\nFourth Quarter and Full Year 2024 Operational and Other Financial Highlights\n•\nFamily daily active people (DAP) – DAP was 3.35 billion on average for December 2024, an increase of 5% year-\nover-year.\n•\nAd impressions – Ad impressions delivered across our Family of Apps increased by 6% and 11% year-over-year \nfor the fourth quarter and full year 2024, respectively. \n•\nAverage price per ad – Average price per ad increased by 14% and 10% year-over-year for the fourth quarter and \nfull year 2024, respectively.\n•\nRevenue – Revenue was $48.39 billion and $164.50 billion, representing increases of 21% and 22% year-over-year \nfor the fourth quarter and full year 2024, respectively. Revenue on a constant currency basis would have increased \n21% and 23% year-over-year for the fourth quarter and full year 2024, respectively.\n•\nCosts and expenses – Total costs and expenses were $25.02 billion and $95.12 billion, representing increases of 5% \nand 8% year-over-year for the fourth quarter and full year 2024, respectively. The fourth quarter costs and expenses \nincluded a favorable impact of $1.55 billion due to a decrease in the accrued losses for certain legal proceedings.\n•\nCapital expenditures – Capital expenditures, including principal payments on finance leases, were $14.84 billion \nand $39.23 billion for the fourth quarter and full year 2024, respectively. \n•\nCapital return program – Share repurchases of our Class A common stock were nil and $29.75 billion, and total \ndividend and dividend equivalent payments were $1.27 billion and $5.07 billion for the fourth quarter and full year \n2024, respectively.\n•\nCash, cash equivalents, and marketable securities – Cash, cash equivalents, and marketable securities were \n$77.81 billion as of December 31, 2024. Free cash flow was $13.15 billion and $52.10 billion for the fourth quarter \nand full year 2024, respectively.\n•\nLong-term debt – Long-term debt was $28.83 billion as of December 31, 2024.\n•\nHeadcount – Headcount was 74,067 as of December 31, 2024, an increase of 10% year-over-year. \n1",
  "CFO Outlook Commentary\nWe expect first quarter 2025 total revenue to be in the range of $39.5-41.8 billion. This reflects 8-15% year-over-year \ngrowth, or 11-18% growth on a constant currency basis as our guidance assumes foreign currency is an approximately 3% \nheadwind to year-over-year total revenue growth, based on current exchange rates. This also reflects the effect of lapping leap \nday in the first quarter of 2024. While we are not providing a full year 2025 revenue outlook, we expect the investments we \nare making in our core business this year will give us an opportunity to continue delivering strong revenue growth throughout \n2025.\nWe expect full year 2025 total expenses to be in the range of $114-119 billion. We expect the single largest driver of expense \ngrowth in 2025 to be infrastructure costs, driven by higher operating expenses and depreciation(1). We expect employee \ncompensation to be the second-largest factor as we add technical talent in the priority areas of infrastructure, monetization, \nReality Labs, generative artificial intelligence (AI), as well as regulation and compliance.\nWe anticipate our full year 2025 capital expenditures will be in the range of $60-65 billion. We expect capital expenditures \ngrowth in 2025 will be driven by increased investment to support both our generative AI efforts and core business. The \nmajority of our capital expenditures in 2025 will continue to be directed to our core business.\nAbsent any changes to our tax landscape, we expect our full year 2025 tax rate to be in the range of 12-15%.\nIn addition, we continue to monitor an active regulatory landscape, including legal and regulatory headwinds in the EU and \nthe U.S. that could significantly impact our business and our financial results.\n____________________________________\n(1) In January 2025, we completed an assessment of the useful lives of certain servers and network assets, which resulted in an increase in \ntheir estimated useful life to 5.5 years, effective beginning fiscal year 2025. Based on the servers and network assets placed in service as of \nDecember 31, 2024, we expect this change in accounting estimate will reduce our full year 2025 depreciation expense by approximately \n$2.9 billion. This is factored into our outlook.\n2",
  "Webcast and Conference Call Information\nMeta will host a conference call to discuss the results at 2:00 p.m. PT / 5:00 p.m. ET today. The live webcast of Meta's \nearnings conference call can be accessed at the Meta Investor Relations website at investor.atmeta.com, along with the \nearnings press release, financial tables, and slide presentation.\nFollowing the call, a replay will be available at the same website. Transcripts of conference calls with publishing equity \nresearch analysts held today will also be posted to the investor.atmeta.com website.\nDisclosure Information\nMeta uses the investor.atmeta.com and about.fb.com/news/ websites as well as Mark Zuckerberg's Facebook Page \n(facebook.com/zuck), Instagram account (instagram.com/zuck) and Threads profile (threads.net/zuck) as means of disclosing \nmaterial non-public information and for complying with its disclosure obligations under Regulation FD.\nAbout Meta\nMeta is building the future of human connection and the technology that makes it possible. When Facebook launched in \n2004, it changed the way people connect. Apps like Messenger, Instagram, and WhatsApp further empowered billions around \nthe world. Now, Meta is moving beyond 2D screens toward immersive experiences like augmented and virtual reality to help \nbuild the next evolution in social technology.\nContacts\nInvestors: \nKenneth Dorell\ninvestor@meta.com / investor.atmeta.com\nPress: \nAshley Zandy\npress@meta.com / about.fb.com/news/\n3",
  "Forward-Looking Statements\nThis press release contains forward-looking statements regarding our future business plans and expectations. These forward-\nlooking statements are only predictions and may differ materially from actual results due to a variety of factors including: the \nimpact of macroeconomic conditions on our business and financial results, including as a result of geopolitical events; our \nability to retain or increase users and engagement levels; our reliance on advertising revenue; our dependency on data signals \nand mobile operating systems, networks, and standards that we do not control; changes to the content or application of third-\nparty policies that impact our advertising practices; risks associated with new products and changes to existing products as \nwell as other new business initiatives, including our artificial intelligence initiatives and metaverse efforts; our emphasis on \ncommunity growth and engagement and the user experience over short-term financial results; maintaining and enhancing our \nbrand and reputation; our ongoing privacy, safety, security, and content and advertising review and enforcement efforts; \ncompetition; risks associated with government actions that could restrict access to our products or impair our ability to sell \nadvertising in certain countries; litigation and government inquiries; privacy, legislative, and regulatory concerns or \ndevelopments; risks associated with acquisitions; security breaches; our ability to manage our scale and geographically-\ndispersed operations; and market conditions or other factors affecting the payment of dividends. These and other potential \nrisks and uncertainties that could cause actual results to differ from the results predicted are more fully detailed under the \ncaption \"Risk Factors\" in our Quarterly Report on Form 10-Q filed with the SEC on October 31, 2024, which is available on \nour Investor Relations website at investor.atmeta.com and on the SEC website at www.sec.gov. Additional information will \nalso be set forth in our Annual Report on Form 10-K for the year ended December 31, 2024. In addition, please note that the \ndate of this press release is January 29, 2025, and any forward-looking statements contained herein are based on assumptions \nthat we believe to be reasonable as of this date. We undertake no obligation to update these statements as a result of new \ninformation or future events.\nFor a discussion of limitations in the measurement of certain of our community metrics, see the section entitled \"Limitations \nof Key Metrics and Other Data\" in our most recent quarterly or annual report filed with the SEC.\nNon-GAAP Financial Measures \nTo supplement our condensed consolidated financial statements, which are prepared and presented in accordance with \ngenerally accepted accounting principles in the United States (GAAP), we use the following non-GAAP financial measures: \nrevenue excluding foreign exchange effect, advertising revenue excluding foreign exchange effect, and free cash flow. The \npresentation of these financial measures is not intended to be considered in isolation or as a substitute for, or superior to, \nfinancial information prepared and presented in accordance with GAAP. Investors are cautioned that there are material \nlimitations associated with the use of non-GAAP financial measures as an analytical tool. In addition, these measures may be \ndifferent from non-GAAP financial measures used by other companies, limiting their usefulness for comparison purposes. \nWe compensate for these limitations by providing specific information regarding the GAAP amounts excluded from these \nnon-GAAP financial measures.\nWe believe these non-GAAP financial measures provide investors with useful supplemental information about the financial \nperformance of our business, enable comparison of financial results between periods where certain items may vary \nindependent of business performance, and allow for greater transparency with respect to key metrics used by management in \noperating our business. \nOur non-GAAP financial measures are adjusted for the following items: \nForeign exchange effect on revenue. We translated revenue for the three months and full year ended December 31, 2024 \nusing the prior year's monthly exchange rates for our settlement or billing currencies other than the U.S. dollar, which we \nbelieve is a useful metric that facilitates comparison to our historical performance.\nPurchases of property and equipment; Principal payments on finance leases. We subtract both purchases of property and \nequipment, and principal payments on finance leases in our calculation of free cash flow because we believe that these two \nitems collectively represent the amount of property and equipment we need to procure to support our business, regardless of \nwhether we procure such property or equipment with a finance lease. We believe that this methodology can provide useful",
  "supplemental information to help investors better understand underlying trends in our business. Free cash flow is not intended \nto represent our residual cash flow available for discretionary expenditures. \nFor more information on our non-GAAP financial measures and a reconciliation of GAAP to non-GAAP measures, please \nsee the \"Reconciliation of GAAP to Non-GAAP Results\" table in this press release.\n4",
  "META PLATFORMS, INC.\nCONDENSED CONSOLIDATED STATEMENTS OF INCOME\n(In millions, except per share amounts)\n(Unaudited)\nThree Months Ended December 31,\nTwelve Months Ended December 31,\n2024\n2023\n2024\n2023\nRevenue\n$ \n48,385 $ \n40,111 $ \n164,501 $ \n134,902 \nCosts and expenses:\n \nCost of revenue\n \n8,839  \n7,695  \n30,161  \n25,959 \nResearch and development\n \n12,180  \n10,517  \n43,873  \n38,483 \nMarketing and sales\n \n3,240  \n3,226  \n11,347  \n12,301 \nGeneral and administrative (1)\n \n761  \n2,289  \n9,740  \n11,408 \nTotal costs and expenses\n \n25,020  \n23,727  \n95,121  \n88,151 \nIncome from operations\n \n23,365  \n16,384  \n69,380  \n46,751 \nInterest and other income, net\n \n188  \n424  \n1,283  \n677 \nIncome before provision for income taxes\n \n23,553  \n16,808  \n70,663  \n47,428 \nProvision for income taxes\n \n2,715  \n2,791  \n8,303  \n8,330 \nNet income\n$ \n20,838 $ \n14,017 $ \n62,360 $ \n39,098 \nEarnings per share:\nBasic\n$ \n8.24 $ \n5.46 $ \n24.61 $ \n15.19 \nDiluted\n$ \n8.02 $ \n5.33 $ \n23.86 $ \n14.87 \nWeighted-average shares used to compute earnings \nper share:\nBasic\n \n2,529  \n2,566  \n2,534  \n2,574 \nDiluted\n \n2,599  \n2,630  \n2,614  \n2,629 \n____________________________________\n(1) The fourth quarter 2024 general and administrative expenses include a favorable impact of $1.55 billion due to a decrease in the accrued \nlosses for certain legal proceedings.\n5",
  "META PLATFORMS, INC.\nCONDENSED CONSOLIDATED BALANCE SHEETS\n(In millions)\n(Unaudited)\nDecember 31, 2024\nDecember 31, 2023\nAssets\nCurrent assets:\nCash and cash equivalents\n$ \n43,889 $ \n41,862 \nMarketable securities\n \n33,926  \n23,541 \nAccounts receivable, net\n \n16,994  \n16,169 \nPrepaid expenses and other current assets\n \n5,236  \n3,793 \nTotal current assets\n \n100,045  \n85,365 \nNon-marketable equity securities\n \n6,070  \n6,141 \nProperty and equipment, net\n \n121,346  \n96,587 \nOperating lease right-of-use assets\n \n14,922  \n13,294 \nGoodwill\n \n20,654  \n20,654 \nOther assets\n \n13,017  \n7,582 \nTotal assets\n$ \n276,054 $ \n229,623 \nLiabilities and stockholders' equity\nCurrent liabilities:\nAccounts payable\n$ \n7,687 $ \n4,849 \nOperating lease liabilities, current\n \n1,942  \n1,623 \nAccrued expenses and other current liabilities\n \n23,967  \n25,488 \nTotal current liabilities\n \n33,596  \n31,960 \nOperating lease liabilities, non-current\n \n18,292  \n17,226 \nLong-term debt\n \n28,826  \n18,385 \nLong-term income taxes\n \n9,987  \n7,514 \nOther liabilities\n \n2,716  \n1,370 \nTotal liabilities\n \n93,417  \n76,455 \nCommitments and contingencies\nStockholders' equity:\nCommon stock and additional paid-in capital\n \n83,228  \n73,253 \nAccumulated other comprehensive loss\n \n(3,097)  \n(2,155) \nRetained earnings\n \n102,506  \n82,070 \nTotal stockholders' equity\n \n182,637  \n153,168 \nTotal liabilities and stockholders' equity\n$ \n276,054 $ \n229,623 \n6",
  "META PLATFORMS, INC.\nCONDENSED CONSOLIDATED STATEMENTS OF CASH FLOWS\n(In millions)\n(Unaudited)\nThree Months Ended \nDecember 31,\nTwelve Months Ended \nDecember 31,\n2024\n2023\n2024\n2023\nCash flows from operating activities\nNet income\n$ \n20,838 $ \n14,017 $ \n62,360 $ \n39,098 \nAdjustments to reconcile net income to net cash provided by \noperating activities:\nDepreciation and amortization\n \n4,460  \n3,172  \n15,498  \n11,178 \nShare-based compensation\n \n4,262  \n3,424  \n16,690  \n14,027 \nDeferred income taxes\n \n(1,332)  \n(1,161)  \n(4,738)  \n131 \nImpairment charges for facilities consolidation\n \n94  \n1,091  \n383  \n2,432 \nData center assets abandonment\n \n—  \n7  \n—  \n(224) \nOther\n \n169  \n124  \n87  \n635 \nChanges in assets and liabilities:\nAccounts receivable\n \n(2,978)  \n(2,843)  \n(1,485)  \n(2,399) \nPrepaid expenses and other current assets\n \n(530)  \n700  \n(698)  \n559 \nOther assets\n \n(200)  \n(111)  \n(270)  \n(80) \nAccounts payable\n \n568  \n595  \n373  \n51 \nAccrued expenses and other current liabilities\n \n1,523  \n(274)  \n323  \n5,081 \nOther liabilities\n \n1,114  \n663  \n2,805  \n624 \nNet cash provided by operating activities\n \n27,988  \n19,404  \n91,328  \n71,113 \nCash flows from investing activities\nPurchases of property and equipment\n \n(14,425)  \n(7,592)  \n(37,256)  \n(27,045) \nPurchases of marketable securities\n \n(10,898)  \n(1,171)  \n(25,542)  \n(2,982) \nSales and maturities of marketable securities\n \n3,817  \n2,359  \n15,789  \n6,184 \nAcquisitions of businesses and intangible assets\n \n(9)  \n(64)  \n(270)  \n(629) \nOther investing activities\n \n17  \n(4)  \n129  \n(23) \nNet cash used in investing activities\n \n(21,498)  \n(6,472)  \n(47,150)  \n(24,495) \nCash flows from financing activities\nTaxes paid related to net share settlement of equity awards\n \n(3,857)  \n(2,223)  \n(13,770)  \n(7,012) \nRepurchases of Class A common stock\n \n—  \n(5,942)  \n(30,125)  \n(19,774) \nPayments for dividends and dividend equivalents\n \n(1,269)  \n—  \n(5,072)  \n— \nProceeds from issuance of long-term debt, net\n \n—  \n—  \n10,432  \n8,455 \nPrincipal payments on finance leases\n \n(411)  \n(307)  \n(1,969)  \n(1,058) \nOther financing activities\n \n72  \n71  \n(277)  \n(111) \nNet cash used in financing activities\n \n(5,465)  \n(8,401)  \n(40,781)  \n(19,500) \nEffect of exchange rate changes on cash, cash equivalents, and \nrestricted cash\n \n(714)  \n396  \n(786)  \n113 \nNet increase in cash, cash equivalents, and restricted cash\n \n311  \n4,927  \n2,611  \n27,231 \nCash, cash equivalents, and restricted cash at beginning of the \nperiod\n \n45,127  \n37,900  \n42,827  \n15,596 \nCash, cash equivalents, and restricted cash at end of the period\n$ \n45,438 $ \n42,827 $ \n45,438 $ \n42,827 \nReconciliation of cash, cash equivalents, and restricted cash to \nthe condensed consolidated balance sheets\nCash and cash equivalents\n$ \n43,889 $ \n41,862 $ \n43,889 $ \n41,862 \nRestricted cash, included in prepaid expenses and other current \nassets\n \n353  \n99  \n353  \n99 \nRestricted cash, included in other assets\n \n1,196  \n866  \n1,196  \n866 \nTotal cash, cash equivalents, and restricted cash\n$ \n45,438 $ \n42,827 $ \n45,438 $ \n42,827 \n7",
  "META PLATFORMS, INC.\nCONDENSED CONSOLIDATED STATEMENTS OF CASH FLOWS\n(In millions)\n(Unaudited)\nThree Months Ended \nDecember 31,\nTwelve Months Ended \nDecember 31,\n2024\n2023\n2024\n2023\nSupplemental cash flow data\nCash paid for income taxes, net\n$ \n2,227 $ \n4,591 $ \n10,554 $ \n6,607 \nCash paid for interest, net of amounts capitalized\n$ \n131 $ \n146 $ \n486 $ \n448 \nNon-cash investing and financing activities:\nProperty and equipment in accounts payable and accrued \nexpenses and other current liabilities\n$ \n7,127 $ \n4,105 $ \n7,127 $ \n4,105 \nAcquisition of businesses and intangible assets in accrued \nexpenses and other current liabilities and other liabilities\n$ \n172 $ \n119 $ \n172 $ \n119 \nRepurchases of Class A common stock in accrued expenses \nand other current liabilities\n$ \n— $ \n474 $ \n— $ \n474 \n8",
  "Segment Results\nWe report our financial results for our two reportable segments: Family of Apps (FoA) and Reality Labs (RL). FoA includes \nFacebook, Instagram, Messenger, WhatsApp, and other services. RL includes our virtual, augmented, and mixed reality \nrelated consumer hardware, software, and content.\nThe following table presents our segment information of revenue and income (loss) from operations:\nSegment Information\n(In millions)\n(Unaudited)\nThree Months Ended \nDecember 31,\nTwelve Months Ended \nDecember 31,\n2024\n2023\n2024\n2023\nRevenue:\nAdvertising\n$ \n46,783 $ \n38,706 $ \n160,633 $ \n131,948 \nOther revenue\n \n519  \n334  \n1,722  \n1,058 \nFamily of Apps\n \n47,302  \n39,040  \n162,355  \n133,006 \nReality Labs\n \n1,083  \n1,071  \n2,146  \n1,896 \nTotal revenue\n$ \n48,385 $ \n40,111 $ \n164,501 $ \n134,902 \nIncome (loss) from operations:\nFamily of Apps\n$ \n28,332 $ \n21,030 $ \n87,109 $ \n62,871 \nReality Labs\n \n(4,967)  \n(4,646)  \n(17,729)  \n(16,120) \nTotal income from operations\n$ \n23,365 $ \n16,384 $ \n69,380 $ \n46,751 \n9",
  "Reconciliation of GAAP to Non-GAAP Results\n(In millions, except percentages)\n(Unaudited)\nThree Months Ended \nDecember 31,\nTwelve Months Ended \nDecember 31,\n2024\n2023\n2024\n2023\nGAAP revenue\n$ 48,385 \n$ \n40,111 $ 164,501 \n$ \n134,902 \nForeign exchange effect on 2024 revenue using 2023 rates\n \n65 \n \n874 \nRevenue excluding foreign exchange effect\n$ 48,450 \n$ 165,375 \nGAAP revenue year-over-year change %\n 21 %\n 22 %\nRevenue excluding foreign exchange effect year-over-year change \n%\n 21 %\n 23 %\nGAAP advertising revenue\n$ 46,783 \n$ \n38,706 $ 160,633 \n$ \n131,948 \nForeign exchange effect on 2024 advertising revenue using 2023 \nrates\n \n81 \n \n880 \nAdvertising revenue excluding foreign exchange effect\n$ 46,864 \n$ 161,513 \nGAAP advertising revenue year-over-year change %\n 21 %\n 22 %\nAdvertising revenue excluding foreign exchange effect year-over-\nyear change %\n 21 %\n 22 %\nNet cash provided by operating activities\n$ 27,988 \n$ \n19,404 $ 91,328 \n$ \n71,113 \nPurchases of property and equipment\n (14,425) \n \n(7,592)  (37,256) \n \n(27,045) \nPrincipal payments on finance leases\n \n(411) \n \n(307)  \n(1,969) \n \n(1,058) \nFree cash flow\n$ 13,152 \n$ \n11,505 $ 52,103 \n$ \n43,010 \n10"
]