[
  "Huy Bui\nwilliamhuybui@gmail.com | linkedin.com/in/huy-bui-ds\nExperience\nPublicis Groupe\nRemote\nSenior Data Scientist\nJune 2022 – Present\n– Developed 7 client-agnostic applications using Python and Dash, empowering 100+ analysts to streamline data\nanalysis and reporting, saving over 4,600 hours of productivity.\n– Led data science initiatives and cross-functional teams to build scalable analytics solutions, driving alignment and\nefficiency in a fast-paced, startup-like environment.\n– Built an automated data pipeline leveraging Python, SQL, BigQuery, AWS Lambda, S3, and EventBridge.\n– Developed regression models and LLM-based procedures to extract insights and optimize marketing spend\nallocation for global enterprises.\n– Enhanced UI/UX by migrating Python codebases to React, using tools and techniques such as Figma, Postman,\nand REST APIs.\nEnovate Upstream\nRemote\nResearch Data Scientist\nApril 2020 – June 2022\n– Lead author of the research Machine Learning Applications to Improve Pore Pressure Prediction in Hazardous\nDrilling Environments, published at OnePetro.\n– Developed time series and physics hybrid-models for drilling measurement predictions, reducing reliance on costly\nlogging tools and saving clients over $200,000.\n– Built a robust data cleaning and standardization pipeline in Python, streamlining data preparation across multiple\nclients and reducing manual processing time by 30%.\nTexas A&M University\nCollege Station, Texas\nTeaching Assistant\nAugust 2017 – May 2019\n– Taught Python, Matlab, Calculus I, II, Differential Equations, and Discrete Mathematics to engineering students,\nassisting with lectures and grading assessments.\nTechnical Skills\nData Science and Programming: Python (Pandas, Numpy, Scikit-learn), SQL, JavaScript, React, BigQuery, LLM.\nOther: OpenAI api, AWS (S3, Redshift), CI/CD (TeamCity, GitHub).\nEducation\nTexas A&M University\nCollege Station, Texas\nMaster of Science in Mathematics\nJuly 2019\n– Final thesis: Discharging Method on the Planar Graph.\nUniversity of Houston - Downtown\nHouston, Texas\nBachelor of Science in Mathematics\nMay 2017\n– Summa Cum Laude, minor in Computer Science.\n– 4 undergraduate researches in Quantum Calculus.\n– President of Math club (3 years), Scholars Academy member, Pi Mu Epsilon member.\nRecognition and Activities\n1st Place Team - Catalyst Award in Centralized Data | Publicis Groupe - CBS Studio\nDecember 2024\n– Recognized for developing a scalable data analytics suite that enhances decision-making and bridges siloed data.\n1st Place Team - Publicis Global Data Intelligence Awards | Publicis Groupe\nNovember 2024\n– Recognized the most innovative analytics solution across Publicis Groupe.\nMentor | Techsphere\nAugust 2022 - August 2024\n– Helped Vietnamese professionals with mock interviews in data science and software engineering.\n1st Place Team at Glasstire DataHack | Rice University\nDecember 2019\n3rd Place Team at TAMU Hack | Texas A&M University\nJanuary 2020"
]